#!/bin/bash

# 卸载旧版本
echo ""
echo ""
echo "#########################################################"
echo "# 卸载旧版本 -- 开始                                    #"
echo "#########################################################"
yum -y remove docker docker-common docker-selinux docker-engine
echo "#########################################################"
echo "# 卸载旧版本 -- 结束                                    #"
echo "#########################################################"

# 安装需要的软件包
echo ""
echo ""
echo "#########################################################"
echo "# 安装需要的软件包 -- 开始                              #"
echo "#########################################################"
yum install -y yum-utils device-mapper-persistent-data lvm2
echo "#########################################################"
echo "# 安装需要的软件包 -- 结束                              #"
echo "#########################################################"

# 设置 yum 源
echo ""
echo ""
echo "#########################################################"
echo "# 设置 yum 源 -- 开始                                   #"
echo "#########################################################"
yum-config-manager --add-repo https://download.docker.com/linux/centos/docker-ce.repo
echo "#########################################################"
echo "# 设置 yum 源 -- 结束                                   #"
echo "#########################################################"

# 安装 docker-ce
echo ""
echo ""
echo "#########################################################"
echo "# 安装 docker-ce -- 开始                                #"
echo "#########################################################"
yum -y install docker-ce
echo "#########################################################"
echo "# 安装 docker-ce -- 结束                                #"
echo "#########################################################"

# 启动并加入开机启动
echo ""
echo ""
echo "#########################################################"
echo "# 启动并加入开机启动 -- 开始                            #"
echo "#########################################################"
systemctl start docker
systemctl enable docker
echo "#########################################################"
echo "# 启动并加入开机启动 -- 结束                            #"
echo "#########################################################"

# 验证安装是否成功
echo ""
echo ""
echo "#########################################################"
echo "# 验证安装是否成功 -- 开始                              #"
echo "#########################################################"
docker version
echo "#########################################################"
echo "# 验证安装是否成功 -- 结束                              #"
echo "#########################################################"

# 安装docker-compose
echo ""
echo ""
echo "#########################################################"
echo "# 安装docker-compose -- 开始                            #"
echo "#########################################################"
curl -L https://github.com/docker/compose/releases/download/1.22.0/docker-compose-$(uname -s)-$(uname -m) -o /usr/local/bin/docker-compose
chmod +x /usr/local/bin/docker-compose
echo "#########################################################"
echo "# 安装docker-compose -- 结束                            #"
echo "#########################################################"

# 验证安装是否成功
echo ""
echo ""
echo "#########################################################"
echo "# 验证安装是否成功 -- 开始                              #"
echo "#########################################################"
docker-compose --version
echo "#########################################################"
echo "# 验证安装是否成功 -- 结束                              #"
echo "#########################################################"

# 添加 docker 国内镜像站点并重启docker
echo ""
echo ""
echo "#########################################################"
echo "# 添加 docker 国内镜像站点并重启docker -- 开始          #"
echo "#########################################################"
echo '{ "registry-mirrors": [ "https://registry.docker-cn.com" ] }' >> /etc/docker/daemon.json
systemctl restart docker
echo "#########################################################"
echo "# 添加 docker 国内镜像站点并重启docker -- 结束          #"
echo "#########################################################"

echo ""
echo ""
echo "install OK!" # 提示安装完成
echo ""
echo "enjoy!"
echo "  tanbushi 2019-01-29"
echo ""
echo ""
